from .data_keys_male import male

# Шкала установки на социально-желательные ответы
check_1 = [
    [2, 0],
    [4, 0],
    [8, 0],
    [13, 1],
    [21, 0],
    [30, 1],
    [32, 1],
    [33, 0],
    [38, 0],
    [54, 0],
    [79, 0],
    [83, 0],
    [87, 0],
]

# Шкала склонности к преодолению норм и правил:
check_2 = [
    [1, 1],
    [10, 0],
    [11, 1],
    [22, 1],
    [34, 1],
    [41, 1],
    [44, 1],
    [50, 1],
    [53, 1],
    [55, 1],
    [59, 1],
    [61, 1],
    [80, 1],
    [86, 0],
    [91, 1],
    [93, 0]
]

# Шкала склонности к аддиктивному поведению:
check_3 = [
    [14, 1],
    [18, 1],
    [22, 1],
    [26, 1],
    [27, 1],
    [31, 1],
    [34, 1],
    [35, 1],
    [43, 1],
    [59, 1],
    [60, 1],
    [62, 1],
    [63, 1],
    [64, 1],
    [67, 1],
    [74, 1],
    [81, 1],
    [91, 1],
    [95, 0],
]

# Шкала склонности к самоповреждающему и саморазрушающему поведению
check_4 = [
    [3, 1],
    [6, 1],
    [9, 1],
    [12, 1],
    [24, 0],
    [27, 1],
    [28, 1],
    [39, 1],
    [51, 1],
    [52, 1],
    [58, 1],
    [68, 1],
    [73, 1],
    [75, 1],
    [76, 1],
    [90, 1],
    [91, 1],
    [92, 1],
    [96, 1],
    [98, 1],
    [99, 1]
]

# Шкала склонности к агрессии и насилию:

check_5 = [
    [3, 1],
    [5, 1],
    [15, 0],
    [16, 1],
    [17, 1],
    [25, 1],
    [40, 0],
    [42, 1],
    [45, 1],
    [48, 1],
    [49, 1],
    [51, 1],
    [65, 1],
    [66, 1],
    [71, 1],
    [77, 1],
    [82, 1],
    [85, 1],
    [89, 1],
    [94, 1],
    [101, 1],
    [102, 1],
    [103, 11],
    [104, 1]

]

# Шкала волевого контроля эмоциональных реакций:
check_6 = [
    [7, 1],
    [19, 1],
    [20, 1],
    [29, 0],
    [36, 1],
    [49, 1],
    [56, 1],
    [57, 1],
    [69, 1],
    [70, 1],
    [71, 1],
    [78, 1],
    [84, 1],
    [89, 1],
    [94, 1]
]
# Шкала склонности к деликвентному поведению:
check_7 = [
    [1, 1],
    [3, 1],
    [7, 1],
    [11, 1],
    [25, 1],
    [28, 1],
    [31, 1],
    [35, 1],
    [43, 1],
    [48, 1],
    [53, 1],
    [58, 1],
    [61, 1],
    [63, 1],
    [64, 1],
    [66, 1],
    [79, 1],
    [93, 0],
    [98, 1],
    [99, 1],
    [102, 1]
]

# Шкала принятия женской социальной роли:

check_8 = [
    [3, 0],
    [5, 0],
    [9, 0],
    [16, 0],
    [18, 0],
    [25, 0],
    [41, 0],
    [45, 0],
    [51, 0],
    [61, 0],
    [68, 0],
    [73, 0],
    [85, 0],
    [93, 1],
    [95, 1],
    [96, 0],
    [105, 1],
    [106, 0],
    [107, 1]
]

female = [
    check_1,
    check_2,
    check_3,
    check_4,
    check_5,
    check_6,
    check_7,
    check_8
]

gender_keys_test = [
    female,
    male
]

normal_datasets = [
    [2.27, 2.06],
    [7.73, 2.88],
    [9.23, 4.59],
    [10.36, 3.41],
    [12.47, 4.23],
    [8.04, 3.29],
    [7.17, 4.05],
    [7.17, 4.05],
]

suicidal_keys = [
    # Альтруистическая
    [1, 8, 15, 22, 29],
    # Анемическая
    [2, 9, 16, 23, 30],
    # анестетическая
    [3, 10, 17, 24, 31],
    # инструментальная
    [4, 11, 18, 25, 32],
    # аутопунитическая
    [5, 12, 19, 26, 33],
    # гетеропунитическая
    [6, 13, 20, 27, ], #34],
    # поствитальная
    [7, 14, 21, 28, ]#35]
]
